testCase/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicWaveMakerFvMesh;

dynamicWaveMakerFvMeshCoeffs
{

	times 3 ( 0 1 2 );

	pistonPositions 1 ( 3 ( 0 .5 0 ) );

	xLeft	.5;
	xRight	3;

//	yPiston  5 ( -2 -1 0 1 2 );
//	positionsToLog	no;
//	amplification	.1;
//	repetitions	2;
//	timeInterpolation	linear;
//	spaceInterpolation	spline;
}

// ************************************************************************* //
